# Создание  списка книг со словарями
books = [
{"title": "Война и мир", "author": "Лев Толстой",  "year": 1869},
{"title": "Преступление и Наказание", "author": "Федор Достоевский",  "year": 1866},
{"title": "Дом в котором", "author": "Мариам Петросян",  "year": 2009},
{"title": "Мастер и Маргарита", "author": "Михаил Булгаков",  "year": 1967},
{"title": "Алиса в Стране чудес", "author": "Льюис Кэрролл",  "year": 1865},
]
# Вывод информации о каждой книге
i = 1
for book in books:
    print(f"----------------------- Книга {i} -----------------------") 
    print(f"Название: {book['title']}, Aвтор: {book['author']},") 
    print(f"-------------------------{book['year']}--------------------------")
    print() #Пустая строка для разделения книг
    i +=1 #Увеличение счетчика
